code-review/NRB_3471_3546/База_Было/Reports/СверкаАгрегированныхРаскрытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаАгрегированныхРаскрытий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСверки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РаскрытиеСпискаВладельцев</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыРаскрытияСписковВладельцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРаскрыто</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПодтверждено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСтатус_</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыРаскрытияСписковВладельцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгрузкаРаздела</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыгрузкаРазделаРСВвВышестоящийДепозитарий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеВыгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриема</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ISIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеференсКД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКД_НРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФиксации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФиксации_НРД</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокЦБ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокЦБ_НРД</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/СостоянияДокументовВФайловомШлюзе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовВФайловомШлюзе</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПакетИзФайловогоШлюза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ВыгрузкаРазделаРСВвВышестоящийДепозитарий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыгрузкаРазделаРСВвВышестоящийДепозитарий</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РаскрытиеСпискаВладельцев</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ТехническаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТехническаяОперация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомерВнутриДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Comment>Регистрационный номер поручения/распоряжения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационнаяДата</Name>
					<Comment>Дата и время регистрации поручения/распоряжения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий1024</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьИнвестиционныйЦентр</Name>
					<Comment>Оповестить Инвестиционный центр</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Reports/СверкаАгрегированныхРаскрытий/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элемент = ОтборыСписковКлиентСервер.НайтиЭлементОтбораПоПредставлению(КомпоновщикНастроек.Настройки.Структура[0].Отбор.Элементы, "Только расхождения");
	Элемент.Использование = ТолькоРасхождения;
	
	ДанныеНРД = ДанныеНРД();
	ДанныеДепозитария = ДанныеДепозитария(ДанныеНРД);
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура("ДанныеСверки", РезультатСверки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
	ЦветРамки = Новый Цвет(0, 0, 0);
	НачалоОбласти = 0; КонецОбласти = 0;
	ВысотаТаблицы = ДокументРезультат.ВысотаТаблицы;
	ШиринаТаблицы = ДокументРезультат.ШиринаТаблицы;
	Для ПерваяСтрокаШапки = 1 По ВысотаТаблицы Цикл
		Если ДокументРезультат.Область(ПерваяСтрокаШапки, 1).ЦветФона = ЦветаСтиля.ЦветФонаШапкиОтчета Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ДокументРезультат.Область(ПерваяСтрокаШапки, 1, ВысотаТаблицы, ШиринаТаблицы).ЦветРамки = Новый Цвет;
	Для Колонка = 1 По ШиринаТаблицы Цикл
		Если ЗначениеЗаполнено(ДокументРезультат.Область(ПерваяСтрокаШапки, Колонка, ПерваяСтрокаШапки, Колонка).Текст) Или Колонка = ШиринаТаблицы Тогда
			Если КонецОбласти > НачалоОбласти Тогда
				Если Колонка = ШиринаТаблицы Тогда
					КонецОбласти = Колонка;
				КонецЕсли;
				Область = ДокументРезультат.Область(ПерваяСтрокаШапки, НачалоОбласти, ВысотаТаблицы, КонецОбласти);
				Область.Обвести(Линия, Линия, Линия, Линия);
			КонецЕсли;
			НачалоОбласти = Колонка;
			КонецОбласти = Колонка;
		Иначе
			КонецОбласти = Колонка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеНРД()
	
	Если ВариантСверки = 1 Тогда
		Обработка = Обработки.ЗагрузкаАгрегированныхРаскрытийНРД.Создать();
		Данные = Обработка.НоваяТаблицаДанныхНРД();
		Обработка.ПрочитатьДанныеExcelФайлаВТаблицу(ПолноеИмяФайла, Данные);
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", КонецДня(ДатаСверки));
		Запрос.Текст = ТекстЗапросаДанныхНРД();
		РезультатЗапроса = Запрос.Выполнить();
		Данные = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	СтрокиКУдалению = Данные.НайтиСтроки(Новый Структура("Состояние", "Удалено"));
	Для Каждого Строка Из СтрокиКУдалению Цикл
		Данные.Удалить(Строка);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ТекстЗапросаДанныхНРД()
	Возврат 
	"ВЫБРАТЬ
	|	ПодтвержденияРСВСрезПоследних.Период КАК ДатаПриема,
	|	ПодтвержденияРСВСрезПоследних.ISIN КАК ISIN,
	|	ПодтвержденияРСВСрезПоследних.ТипКД КАК ТипКД,
	|	ПодтвержденияРСВСрезПоследних.РеференсКД КАК РеференсКД,
	|	ПодтвержденияРСВСрезПоследних.ДатаФиксации КАК ДатаФиксации,
	|	ПодтвержденияРСВСрезПоследних.Раздел КАК Раздел,
	|	ПодтвержденияРСВСрезПоследних.Состояние КАК Состояние,
	|	ПодтвержденияРСВСрезПоследних.ОстатокЦБ КАК ОстатокЦБ,
	|	ПодтвержденияРСВСрезПоследних.РаскрытоЦБ КАК РаскрытоЦБ
	|ИЗ
	|	РегистрСведений.ПодтвержденияРСВ.СрезПоследних(&Период, ) КАК ПодтвержденияРСВСрезПоследних
	|ГДЕ
	|	КОНЕЦПЕРИОДА(ПодтвержденияРСВСрезПоследних.Период, ДЕНЬ) = &Период"
КонецФункции

Функция ТекстЗапросаДанныхДепо()
	Возврат 
	"ВЫБРАТЬ
	|	втДанныеНРД.ISIN КАК ISIN,
	|	втДанныеНРД.ТипКД КАК ТипКД,
	|	втДанныеНРД.РеференсКД КАК РеференсКД,
	|	втДанныеНРД.ДатаФиксации КАК ДатаФиксации,
	|	втДанныеНРД.Раздел КАК Раздел
	|ПОМЕСТИТЬ втДанныеНРД
	|ИЗ
	|	&ДанныеНРД КАК втДанныеНРД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаскрытияСпискаВладельцев.Ссылка КАК Раскрытие,
	|	РаскрытияСпискаВладельцев.Статус КАК Статус,
	|	РаскрытияСпискаВладельцев.СвязанныйВидКД2.Код КАК ТипКД,
	|	РаскрытияСпискаВладельцев.СвязанныйРеференсКД2 КАК РеференсКД,
	|	РаскрытияСпискаВладельцев.ДатаФиксации КАК ДатаФиксации,
	|	РаскрытияСпискаВладельцев.ЦеннаяБумага1 КАК ЦеннаяБумага,
	|	РаскрытияСпискаВладельцев.СчетДЕПО КАК СчетДЕПО,
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка КАК Выгрузка,
	|	ТехническаяОперация.Дата КАК ДатаВыгрузки,
	|	ПРЕДСТАВЛЕНИЕ(СостоянияДокументовВФайловомШлюзеСрезПоследних.Статус) КАК Состояние,
	|	СостоянияДокументовВФайловомШлюзеСрезПоследних.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ втВыгрузкиРаскрытий
	|ИЗ
	|	Документ.ВыгрузкаРазделаРСВвВышестоящийДепозитарий КАК ВыгрузкаРазделаРСВвВышестоящийДепозитарий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытияСпискаВладельцев
	|		ПО ВыгрузкаРазделаРСВвВышестоящийДепозитарий.РаскрытиеСпискаВладельцев = РаскрытияСпискаВладельцев.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТехническаяОперация КАК ТехническаяОперация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДокументовВФайловомШлюзе.СрезПоследних КАК СостоянияДокументовВФайловомШлюзеСрезПоследних
	|			ПО ТехническаяОперация.Ссылка = СостоянияДокументовВФайловомШлюзеСрезПоследних.Документ
	|		ПО ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка = ТехническаяОперация.ДокументОснование
	|			И (ТехническаяОперация.Ссылка В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					Документ.ТехническаяОперация.Ссылка
	|				ИЗ
	|					Документ.ТехническаяОперация
	|				ГДЕ
	|					Документ.ТехническаяОперация.ДокументОснование = ВыгрузкаРазделаРСВвВышестоящийДепозитарий.Ссылка
	|				УПОРЯДОЧИТЬ ПО
	|					Документ.ТехническаяОперация.Дата УБЫВ))
	|			И (&ДатаСверки = НЕОПРЕДЕЛЕНО
	|				ИЛИ НАЧАЛОПЕРИОДА(ТехническаяОперация.Дата, ДЕНЬ) = &ДатаСверки)
	|ГДЕ
	|	ВыгрузкаРазделаРСВвВышестоящийДепозитарий.ПометкаУдаления = ЛОЖЬ
	|	И РаскрытияСпискаВладельцев.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБ.Раскрытие КАК Раскрытие,
	|	ОстаткиЦБ.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБ.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	СУММА(ОстаткиЦБ.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ втОстаткиЦБ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиЦБОстатки.СчетДепо КАК СчетДепо,
	|		ОстаткиЦБОстатки.РазделСчетаДепо КАК РазделСчетаДепо,
	|		ОстаткиЦБОстатки.ЦБ КАК ЦБ,
	|		ОстаткиЦБОстатки.СчетДепоМХ КАК СчетДепоМХ,
	|		ОстаткиЦБОстатки.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|		ОстаткиЦБОстатки.СтатусЦБ КАК СтатусЦБ,
	|		ОстаткиЦБОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|		втВыгрузкиРаскрытий.Раскрытие КАК Раскрытие
	|	ИЗ
	|		РегистрНакопления.ОстаткиЦБ.Остатки КАК ОстаткиЦБОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВыгрузкиРаскрытий КАК втВыгрузкиРаскрытий
	|			ПО ОстаткиЦБОстатки.РазделСчетаДепоМХ = втВыгрузкиРаскрытий.РазделСчетаДепоМХ
	|				И ОстаткиЦБОстатки.СчетДепоМХ = втВыгрузкиРаскрытий.СчетДЕПО
	|				И ОстаткиЦБОстатки.ЦБ = втВыгрузкиРаскрытий.ЦеннаяБумага
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияЦБ.СчетДепо,
	|		ДвиженияЦБ.РазделСчетаДепо,
	|		ДвиженияЦБ.ЦБ,
	|		ДвиженияЦБ.СчетДепоМХ,
	|		ДвиженияЦБ.РазделСчетаДепоМХ,
	|		ДвиженияЦБ.СтатусЦБ,
	|		ВЫБОР
	|			КОГДА ДвиженияЦБ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ДвиженияЦБ.Количество
	|			ИНАЧЕ -ДвиженияЦБ.Количество
	|		КОНЕЦ,
	|		втВыгрузкиРаскрытий.Раскрытие
	|	ИЗ
	|		РегистрНакопления.ОстаткиЦБ КАК ДвиженияЦБ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВыгрузкиРаскрытий КАК втВыгрузкиРаскрытий
	|			ПО ДвиженияЦБ.РазделСчетаДепоМХ = втВыгрузкиРаскрытий.РазделСчетаДепоМХ
	|				И ДвиженияЦБ.СчетДепоМХ = втВыгрузкиРаскрытий.СчетДЕПО
	|				И ДвиженияЦБ.ЦБ = втВыгрузкиРаскрытий.ЦеннаяБумага
	|				И (НАЧАЛОПЕРИОДА(ДвиженияЦБ.Период, ДЕНЬ) > втВыгрузкиРаскрытий.ДатаФиксации)) КАК ОстаткиЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБ.РазделСчетаДепоМХ,
	|	ОстаткиЦБ.СчетДепоМХ,
	|	ОстаткиЦБ.Раскрытие,
	|	ОстаткиЦБ.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыгрузкиРаскрытий.Раскрытие КАК Раскрытие,
	|	ВыгрузкиРаскрытий.Статус КАК Статус,
	|	ВыгрузкиРаскрытий.ТипКД КАК ТипКД,
	|	ВыгрузкиРаскрытий.РеференсКД КАК РеференсКД,
	|	ВыгрузкиРаскрытий.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВыгрузкиРаскрытий.ЦеннаяБумага.ISIN КАК ISIN,
	|	ВыгрузкиРаскрытий.ДатаФиксации КАК ДатаФиксации,
	|	ВыгрузкиРаскрытий.РазделСчетаДепоМХ.Код КАК Раздел,
	|	ВыгрузкиРаскрытий.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ВыгрузкиРаскрытий.Выгрузка КАК ВыгрузкаРаздела,
	|	ВыгрузкиРаскрытий.ДатаВыгрузки КАК ДатаВыгрузки,
	|	ОстаткиЦБОстатки.КоличествоОстаток КАК ОстатокЦБ,
	|	ВыгрузкиРаскрытий.Состояние КАК СостояниеВыгрузки
	|ИЗ
	|	втВыгрузкиРаскрытий КАК ВыгрузкиРаскрытий
	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстаткиЦБ КАК ОстаткиЦБОстатки
	|		ПО ВыгрузкиРаскрытий.РазделСчетаДепоМХ = ОстаткиЦБОстатки.РазделСчетаДепоМХ
	|			И ВыгрузкиРаскрытий.Раскрытие = ОстаткиЦБОстатки.Раскрытие
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаскрытияСпискаВладельцев.Ссылка,
	|	РаскрытияСпискаВладельцев.Статус,
	|	втДанныеНРД.ТипКД,
	|	втДанныеНРД.РеференсКД,
	|	РаскрытияСпискаВладельцев.ЦеннаяБумага1,
	|	втДанныеНРД.ISIN,
	|	втДанныеНРД.ДатаФиксации,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	""Не выгружалось""
	|ИЗ
	|	втДанныеНРД КАК втДанныеНРД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаскрытиеСпискаВладельцев КАК РаскрытияСпискаВладельцев
	|		ПО втДанныеНРД.РеференсКД = РаскрытияСпискаВладельцев.СвязанныйРеференсКД2
	|			И втДанныеНРД.ДатаФиксации = РаскрытияСпискаВладельцев.ДатаФиксации
	|			И втДанныеНРД.ISIN = РаскрытияСпискаВладельцев.ЦеннаяБумага1.ISIN
	|			И (НЕ РаскрытияСпискаВладельцев.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВыгрузкиРаскрытий КАК ВыгрузкиРаскрытий
	|		ПО (РаскрытияСпискаВладельцев.Ссылка = ВыгрузкиРаскрытий.Раскрытие)
	|ГДЕ
	|	ВыгрузкиРаскрытий.Раскрытие ЕСТЬ NULL
	|ИТОГИ
	|	МАКСИМУМ(Статус),
	|	МАКСИМУМ(ТипКД),
	|	МАКСИМУМ(РеференсКД),
	|	МАКСИМУМ(ISIN),
	|	МАКСИМУМ(ДатаФиксации),
	|	МАКСИМУМ(ВыгрузкаРаздела)
	|ПО
	|	Раскрытие"
КонецФункции

Функция ДанныеДепозитария(ДанныеНРД)
	
	РезультатСверки.Очистить();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеНРД", ДанныеНРД);
	Запрос.УстановитьПараметр("ДатаСверки", ?(ВариантСверки = 1, Неопределено, ДатаСверки));
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(ДатаСверки)+1);
	Запрос.Текст = ТекстЗапросаДанныхДепо();
	РезультатЗапроса = Запрос.Выполнить();
	ДанныеДепозитария = РезультатЗапроса.Выгрузить().СкопироватьКолонки();
	ДанныеДепозитария.Колонки.Добавить("РаскрытоЦБ", Новый ОписаниеТипов("Число"));
	ВыборкаРаскрытий = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Отбор = Новый Структура("ISIN,РеференсКД,ДатаФиксации");
	Пока ВыборкаРаскрытий.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Отбор, ВыборкаРаскрытий);
		СтрокиНРД = ДанныеНРД.НайтиСтроки(Отбор);
		ВыборкаВыгрузок = ВыборкаРаскрытий.Выбрать();
		ВыборкаВыгрузок.Следующий();
		КоличестваПоРазделамРСВ = КоличестваПоРазделамРСВ(ВыборкаРаскрытий.Раскрытие);
		Для Каждого ВыборкаРазделовРСВ Из КоличестваПоРазделамРСВ Цикл
			Строка = ДанныеДепозитария.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаРаскрытий);
			Если ЗначениеЗаполнено(ВыборкаРаскрытий.ВыгрузкаРаздела) Тогда // есть выгрузки, надо поискать подходящую 
				ВыборкаВыгрузок.Сбросить();
				ВыборкаВыгрузок.НайтиСледующий(ВыборкаРазделовРСВ.РазделСчетаДепоМХ, "РазделСчетаДепоМХ");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаВыгрузок);
			Строка.Раздел = Строка(ВыборкаРазделовРСВ.РазделСчетаДепоМХ);
			Строка.РаскрытоЦБ = ВыборкаРазделовРСВ.КоличествоЦБ;
			
			Строка = РезультатСверки.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаРаскрытий);
			ЗаполнитьЗначенияСвойств(Строка, ВыборкаВыгрузок);
			Строка.РаскрытиеСпискаВладельцев = ВыборкаРаскрытий.Раскрытие;
			Строка.ТекущийСтатус = ВыборкаРаскрытий.Статус;
			Строка.Раздел = Строка(ВыборкаРазделовРСВ.РазделСчетаДепоМХ);
			Строка.КоличествоРаскрыто = ВыборкаРазделовРСВ.КоличествоЦБ;
			Если ЗначениеЗаполнено(СтрокиНРД) Тогда
				Для Каждого СтрокаНРД Из СтрокиНРД Цикл
					Если СтрокаНРД.Раздел = Строка.Раздел Тогда
						ДозаполнитьДанныеНРД(Строка, СтрокаНРД);
						СтрокиНРД.Удалить(СтрокиНРД.Найти(СтрокаНРД));
						ДанныеНРД.Удалить(СтрокаНРД);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаНРД Из СтрокиНРД Цикл
			Строка = РезультатСверки.Добавить();
			Строка.РаскрытиеСпискаВладельцев = ВыборкаРаскрытий.Раскрытие;
			Строка.ТекущийСтатус = ВыборкаРаскрытий.Статус;
			Строка.Раздел = СтрокаНРД.Раздел;
			Строка.ISIN = СтрокаНРД.ISIN;
			Строка.РеференсКД = СтрокаНРД.РеференсКД;
			ДозаполнитьДанныеНРД(Строка, СтрокаНРД);
			ДанныеНРД.Удалить(СтрокаНРД);
		КонецЦикла;
		Если ЗначениеЗаполнено(ВыборкаРаскрытий.ВыгрузкаРаздела) Тогда // были выгрузки, нужно убедиться, что все они попали в таблицу
			ВыборкаВыгрузок.Сбросить();
			Пока ВыборкаВыгрузок.Следующий() Цикл
				Если ДанныеДепозитария.Найти(ВыборкаВыгрузок.ВыгрузкаРаздела, "ВыгрузкаРаздела") = Неопределено Тогда
					Строка = ДанныеДепозитария.Добавить();
					ЗаполнитьЗначенияСвойств(Строка, ВыборкаВыгрузок);
					Строка = РезультатСверки.Добавить();
					ЗаполнитьЗначенияСвойств(Строка, ВыборкаВыгрузок);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаНРД Из ДанныеНРД Цикл
		Строка = РезультатСверки.Добавить();
		Строка.ISIN = СтрокаНРД.ISIN;
		Строка.РеференсКД = СтрокаНРД.РеференсКД;
		Строка.Раздел = СтрокаНРД.Раздел;
		ДозаполнитьДанныеНРД(Строка, СтрокаНРД);
	КонецЦикла;
	
	Возврат ДанныеДепозитария;
	
КонецФункции

Функция КоличестваПоРазделамРСВ(РСВ)
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("РазделСчетаДепоМХ");
	Результат.Колонки.Добавить("КоличествоЦБ");
	Если РСВ.СводноеРаскрытие.Количество() > 0 Тогда
		Для Каждого Строка Из РСВ.СводноеРаскрытие Цикл
			Если Строка.НалоговаяСтавка = Неопределено Тогда // выбираем итоговые записи по разделам
				ЗаполнитьЗначенияСвойств(Результат.Добавить(), Строка);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Раскрытие = РСВ.ПолучитьОбъект();
		РезультатСводногоРаскрытия = Раскрытие.ВыборкаДанныхЗаполненияСводногоРСВ();
		Разделы = РезультатСводногоРаскрытия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Разделы.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), Разделы);
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ДозаполнитьДанныеНРД(Строка, СтрокаНРД)
	Строка.КоличествоПодтверждено = СтрокаНРД.РаскрытоЦБ;
	Строка.СостояниеВыгрузки = СтрокаНРД.Состояние;
	Строка.ДатаФиксации_НРД = СтрокаНРД.ДатаФиксации;
	Строка.ОстатокЦБ_НРД = СтрокаНРД.ОстатокЦБ;
	Строка.ДатаПриема = СтрокаНРД.ДатаПриема;
	Строка.ТипКД_НРД = СтрокаНРД.ТипКД;
КонецПроцедуры
